// departments.dart 파일

// 각 부서별 전공 목록을 포함하는 맵 정의
Map<String, List<String>> departments = {
  '문과대학' : ['국어국문·창작', '영어영문학과','응용영어콘텐츠',
    '일어일문학','프랑스어문학',
  '문헌정보학과', '사학과', '기독교학과'],

  '사범대학' : ['국어교육과','영어교육과','교육학과','역사교육과','미술교육과',
    '수학교육과'],

  '공과대학' : ['정보통신','전기전자공학','멀티미디어','건축학과',
    '건축공학','토목환경','기계공학과',
    '화학공학과','신소재공학'],

  '스마트융합대학' : ['컴퓨터공학과','산업경영공학','융합학과','수학과','빅데이터응용'],

  '경상대학' : ['경영학과','회계학과','무역물류학과','경제학과','중국경제통상',
    '호텔항공경영','경영정보학과'],

  '사회과학대학' : ['법학전공','법무법학전공','행정학과',
    '경찰학과','정치·언론','사회복지학과','아동복지학과','상담심리학과',
    '사회적경제기업학과'],

  '생명·나노과학대학' : ['생명시스템과학','식품영양학과','화학과','간호학과','스포츠과학과',
    '바이오제약','융합기술·경영'],

  '탈메이지교양·융합대학' : ['교학팀','창의융합학부','한남디자인\n팩토리','교양학부','자유전공학부,'],

  '아트&디자인테크놀로지대학' : ['융합디자인학과','회화과','패션디자인학과','미디어영상학과'],

  '린튼글로벌스쿨' : ['글로벌\n비즈니스전공','글로벌미디어\n·컬처전공'],

};
